common/src/java-test/com/zimbra/common/soap/GetInfoRequestSOAP.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<!--
 * ***** BEGIN LICENSE BLOCK *****
 * Zimbra Collaboration Suite Server
 * Copyright (C) 2012, 2013, 2014, 2016 Synacor, Inc.
 *
 * The contents of this file are subject to the Common Public Attribution License Version 1.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at: https://www.zimbra.com/license
 * The License is based on the Mozilla Public License Version 1.1 but Sections 14 and 15
 * have been added to cover use of software over a computer network and provide for limited attribution
 * for the Original Developer. In addition, Exhibit A has been modified to be consistent with Exhibit B.
 *
 * Software distributed under the License is distributed on an "AS IS" basis,
 * WITHOUT WARRANTY OF ANY KIND, either express or implied.
 * See the License for the specific language governing rights and limitations under the License.
 * The Original Code is Zimbra Open Source Web Client.
 * The Initial Developer of the Original Code is Zimbra, Inc.  All rights to the Original Code were
 * transferred by Zimbra, Inc. to Synacor, Inc. on September 14, 2015.
 *
 * All portions of the code are Copyright (C) 2012, 2013, 2014, 2016 Synacor, Inc. All Rights Reserved.
 * ***** END LICENSE BLOCK *****
-->
  <soap:Header>
    <context xmlns="urn:zimbra">
      <authToken>0_817b05823c48b547835c3ba5007f0b64c8eb44df_69643d33363a65306661666438392d313336302d313164392d383636312d3030306139356439386566323b6578703d31333a313334303430363237343430333b61646d696e3d313a313b747970653d363a7a696d6272613b</authToken>
      <nosession/>
      <userAgent name="zmsoap"/>
    </context>
  </soap:Header>
  <soap:Body>
    <GetAccountInfoRequest xmlns="urn:zimbraAdmin">
      <account by="name">user1</account>
    </GetAccountInfoRequest>
  </soap:Body>
</soap:Envelope>
